## Day 23

In [1]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])
print (df)

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print (df)
print (df['one'].isnull())
print (df['one'].notnull())
print (df['one'].sum())
"""When summing data, NA will be treated as Zero
If the data are all NA, then the result will be NA"""
print ("NaN replaced with '0':")
print (df.fillna(0))
print (df.dropna())

        one       two     three
a -1.233977  0.649843 -0.030105
c -1.098515 -2.274116  1.544095
e -0.333700  0.094030  0.452237
f  1.080810  0.196696 -0.537987
h -0.421683 -0.064890 -0.981550
        one       two     three
a -1.233977  0.649843 -0.030105
b       NaN       NaN       NaN
c -1.098515 -2.274116  1.544095
d       NaN       NaN       NaN
e -0.333700  0.094030  0.452237
f  1.080810  0.196696 -0.537987
g       NaN       NaN       NaN
h -0.421683 -0.064890 -0.981550
a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool
a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool
-2.0070649776618184
NaN replaced with '0':
        one       two     three
a -1.233977  0.649843 -0.030105
b  0.000000  0.000000  0.000000
c -1.098515 -2.274116  1.544095
d  0.000000  0.000000  0.000000
e -0.333700  0.094030  0.452237
f  1.080810  0.196696 -0.537987
g  0.000000  0.000000  0.000000
h -0.421683 -0.064890 -0.981550
        one       two     three
a -1.233977  0.649843 -0.030105
c -1.098515 -2.274116  1.544095
e -0.333700  0.094030  0.452237
f  1.080810  0.196696 -0.537987
h -0.421683 -0.064890 -0.981550

In [14]:
df = pd.read_csv('https://query.data.world/s/Hfu_PsEuD1Z_yJHmGaxWTxvkz7W_b0')

In [62]:
df.tail(n=10)

      Team  Rank  Year  Points
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [20]:
print(np.sum(df.isnull()))

Ord_id                   0
Prod_id                  0
Ship_id                  0
Cust_id                  0
Sales                   20
Discount                55
Order_Quantity          55
Profit                  55
Shipping_Cost           55
Product_Base_Margin    109
dtype: int64

In [25]:
print(round((df.isnull().sum() *100)/len(df),2))

Ord_id                 0.00
Prod_id                0.00
Ship_id                0.00
Cust_id                0.00
Sales                  0.24
Discount               0.65
Order_Quantity         0.65
Profit                 0.65
Shipping_Cost          0.65
Product_Base_Margin    1.30
dtype: float64

In [28]:
df = df.dropna(thresh = 5)

In [29]:
print(round((df.isnull().sum() *100)/len(df),2))

Ord_id                 0.00
Prod_id                0.00
Ship_id                0.00
Cust_id                0.00
Sales                  0.00
Discount               0.42
Order_Quantity         0.42
Profit                 0.42
Shipping_Cost          0.42
Product_Base_Margin    1.06
dtype: float64

### Group BY

In [32]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings','kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

print( df)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [34]:
grouped = df.groupby('Year')
for name,group in grouped:
    print (name)
    print (group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [35]:
print ("\n2014 Data\n",grouped.get_group(2014))

2014 Data
      Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [36]:
grouped = df.groupby('Year')

In [37]:
print (grouped['Points'].agg(np.mean))
print (grouped['Points'].agg(np.sum))
print (grouped['Points'].agg(np.average))

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64
Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64
Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [38]:
print(df.groupby("Year").Points.sum())

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [39]:
print(grouped["Points"].sum())

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

## Merge

In [41]:
df1 = pd.DataFrame({
         'id':[1,2,3,4,5],
         'Name': ['Piyush', 'Gautam', 'Garry', 'Abhishek', 'Ankit'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']})
df2 = pd.DataFrame(
         {'id':[1,2,3,4,5],
         'Name': ['Saurabh', 'Akshay', 'Rajat', 'Ankush', 'Sam'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print ("\nData Frame 1\n",df1)
print ("\nData Frame 2\n",df2)

Data Frame 1
    id      Name subject_id
0   1    Piyush       sub1
1   2    Gautam       sub2
2   3     Garry       sub4
3   4  Abhishek       sub6
4   5     Ankit       sub5

Data Frame 2
    id     Name subject_id
0   1  Saurabh       sub2
1   2   Akshay       sub4
2   3    Rajat       sub3
3   4   Ankush       sub6
4   5      Sam       sub5

In [43]:
print ("\n",pd.merge(df1,df2,on='id'))

    id    Name_x subject_id_x   Name_y subject_id_y
0   1    Piyush         sub1  Saurabh         sub2
1   2    Gautam         sub2   Akshay         sub4
2   3     Garry         sub4    Rajat         sub3
3   4  Abhishek         sub6   Ankush         sub6
4   5     Ankit         sub5      Sam         sub5

In [44]:
print ("\n",pd.merge(df1,df2,on=['id','subject_id']))

    id    Name_x subject_id  Name_y
0   4  Abhishek       sub6  Ankush
1   5     Ankit       sub5     Sam

In [45]:
print ("\n",pd.merge(df1,df2, on='subject_id', how='left'))

    id_x    Name_x subject_id  id_y   Name_y
0     1    Piyush       sub1   NaN      NaN
1     2    Gautam       sub2   1.0  Saurabh
2     3     Garry       sub4   2.0   Akshay
3     4  Abhishek       sub6   4.0   Ankush
4     5     Ankit       sub5   5.0      Sam

In [46]:
print ("\n",pd.merge(df1,df2, on='subject_id', how='right'))

    id_x    Name_x subject_id  id_y   Name_y
0   2.0    Gautam       sub2     1  Saurabh
1   3.0     Garry       sub4     2   Akshay
2   4.0  Abhishek       sub6     4   Ankush
3   5.0     Ankit       sub5     5      Sam
4   NaN       NaN       sub3     3    Rajat

In [47]:
print ("\n",pd.merge(df1,df2, on='subject_id', how='outer'))

    id_x    Name_x subject_id  id_y   Name_y
0   1.0    Piyush       sub1   NaN      NaN
1   2.0    Gautam       sub2   1.0  Saurabh
2   3.0     Garry       sub4   2.0   Akshay
3   4.0  Abhishek       sub6   4.0   Ankush
4   5.0     Ankit       sub5   5.0      Sam
5   NaN       NaN       sub3   3.0    Rajat

In [48]:
print ("\n",pd.merge(df1,df2, on='subject_id', how='inner'))

    id_x    Name_x subject_id  id_y   Name_y
0     2    Gautam       sub2     1  Saurabh
1     3     Garry       sub4     2   Akshay
2     4  Abhishek       sub6     4   Ankush
3     5     Ankit       sub5     5      Sam

## Concatenation

In [49]:
one = pd.DataFrame({
         'Name': ['Akash', 'Abhishek', 'Arpit', 'aayush', 'Ankit'],
         'subject':['sub1','sub2','sub4','sub6','sub5'],
         'Marks':[98,90,87,69,78]},
         index=[1,2,3,4,5])
two = pd.DataFrame({
         'Name': ['Bobby', 'Bhavnish', 'Bhavya', 'Bonny', 'Brett'],
         'subject':['sub2','sub4','sub3','sub6','sub5'],
         'Marks':[89,80,79,97,88]},
         index=[1,2,3,4,5])

In [50]:
print ("\n",pd.concat([one,two]))

        Name subject  Marks
1     Akash    sub1     98
2  Abhishek    sub2     90
3     Arpit    sub4     87
4    aayush    sub6     69
5     Ankit    sub5     78
1     Bobby    sub2     89
2  Bhavnish    sub4     80
3    Bhavya    sub3     79
4     Bonny    sub6     97
5     Brett    sub5     88

In [51]:
print(one)
print(two)

       Name subject  Marks
1     Akash    sub1     98
2  Abhishek    sub2     90
3     Arpit    sub4     87
4    aayush    sub6     69
5     Ankit    sub5     78
       Name subject  Marks
1     Bobby    sub2     89
2  Bhavnish    sub4     80
3    Bhavya    sub3     79
4     Bonny    sub6     97
5     Brett    sub5     88

In [53]:
print ("\n",pd.concat([one,two],ignore_index = True))

        Name subject  Marks
0     Akash    sub1     98
1  Abhishek    sub2     90
2     Arpit    sub4     87
3    aayush    sub6     69
4     Ankit    sub5     78
5     Bobby    sub2     89
6  Bhavnish    sub4     80
7    Bhavya    sub3     79
8     Bonny    sub6     97
9     Brett    sub5     88

In [54]:
print ("\n",pd.concat([one,two],axis = 1))

        Name subject  Marks      Name subject  Marks
1     Akash    sub1     98     Bobby    sub2     89
2  Abhishek    sub2     90  Bhavnish    sub4     80
3     Arpit    sub4     87    Bhavya    sub3     79
4    aayush    sub6     69     Bonny    sub6     97
5     Ankit    sub5     78     Brett    sub5     88

In [55]:
print( one.append(two))

       Name subject  Marks
1     Akash    sub1     98
2  Abhishek    sub2     90
3     Arpit    sub4     87
4    aayush    sub6     69
5     Ankit    sub5     78
1     Bobby    sub2     89
2  Bhavnish    sub4     80
3    Bhavya    sub3     79
4     Bonny    sub6     97
5     Brett    sub5     88

In [59]:
print(one.append([one,two,one]))

       Name subject  Marks
1     Akash    sub1     98
2  Abhishek    sub2     90
3     Arpit    sub4     87
4    aayush    sub6     69
5     Ankit    sub5     78
1     Akash    sub1     98
2  Abhishek    sub2     90
3     Arpit    sub4     87
4    aayush    sub6     69
5     Ankit    sub5     78
1     Bobby    sub2     89
2  Bhavnish    sub4     80
3    Bhavya    sub3     79
4     Bonny    sub6     97
5     Brett    sub5     88
1     Akash    sub1     98
2  Abhishek    sub2     90
3     Arpit    sub4     87
4    aayush    sub6     69
5     Ankit    sub5     78

In [60]:
print ("\n",pd.concat([one,two],keys=['x','y']))

          Name subject  Marks
x 1     Akash    sub1     98
  2  Abhishek    sub2     90
  3     Arpit    sub4     87
  4    aayush    sub6     69
  5     Ankit    sub5     78
y 1     Bobby    sub2     89
  2  Bhavnish    sub4     80
  3    Bhavya    sub3     79
  4     Bonny    sub6     97
  5     Brett    sub5     88